# Используем официальный образ Python на основе Alpine (легковесный)
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей
COPY requirements.txt .

# Устанавливаем зависимости без кеширования
RUN pip install --no-cache-dir -r requirements.txt

# Копируем исходный код приложения
COPY app.py .

# Сообщаем Docker, что контейнер будет слушать порт 4200
EXPOSE 4200

# Команда запуска приложения через Uvicorn
# --host 0.0.0.0 нужен для доступа к контейнеру извне
CMD ["uvicorn", "app:app", "--host", "0.0.0.0", "--port", "4200"]